abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of Freescale Semiconductor, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "fsl_csec_driver.h"

/**
 * @page misra_violations MISRA-C:2012 violations
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 1.3, Taking address of near auto variable
 * The code is not dynamically linked. An absolute stack address is obtained when
 * taking the address of the near auto variable. A source of error in writing
 * dynamic code is that the stack segment may be different from the data segment.
 *
 * @section [global]
 * Violates MISRA 2012 Advisory Rule 11.4, Conversion between a pointer and
 * integer type.
 * The cast is required to initialize a pointer with an unsigned long define,
 * representing an address.
 *
 * @section [global]
 * Violates MISRA 2012 Required Rule 11.6, Cast from unsigned int to pointer.
 * The cast is required to initialize a pointer with an unsigned long define,
 * representing an address.
 */


/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define CSEC_PAGE_SIZE_IN_BYTES    (16U)

#define CSEC_DATA_PAGES_AVAILABLE   (7U)
#define CSEC_DATA_BYTES_AVAILABLE   (112U)

#define CSEC_BYTES_TO_FROM_PAGES_SHIFT   (4U)
#define CSEC_BYTES_TO_FROM_BITS_SHIFT    (3U)

#define CSEC_M1_SIZE_IN_BYTES   (16U)
#define CSEC_M2_SIZE_IN_BYTES   (32U)
#define CSEC_M3_SIZE_IN_BYTES   (16U)
#define CSEC_M4_SIZE_IN_BYTES   (32U)
#define CSEC_M5_SIZE_IN_BYTES   (16U)

/*******************************************************************************
 * Private Functions
 ******************************************************************************/

static inline uint32_t CSEC_DRV_RoundTo(uint32_t value, uint32_t roundTo)
{
    return (value + (roundTo - 1U)) & ~(roundTo - 1U);
}

/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_EncryptECB
 * Description   : This function performs the AES-128 encryption in ECB mode of
 * the input plain text buffer.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_EncryptECB(csec_key_id_t keyId,
                                      const uint8_t *plainText,
                                      uint32_t length,
                                      uint8_t *cipherText)
{
    uint32_t numPagesLeft = length >> CSEC_BYTES_TO_FROM_PAGES_SHIFT;
    csec_error_code_t stat = CSEC_NO_ERROR;
    uint8_t index = 0;

    /* Loop and launch commands until the end of the plain text */
    while (numPagesLeft > 0U)
    {
        uint16_t numPages = (uint16_t)((numPagesLeft > CSEC_DATA_PAGES_AVAILABLE) ?
                                        CSEC_DATA_PAGES_AVAILABLE : numPagesLeft);
        uint8_t numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);

        /* Write the plain text */
        CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &plainText[index], numBytes);
        /* Write the size of the plain text (in pages) */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_PAGE_LENGTH_OFFSET, numPages);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_ENC_ECB, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, keyId);

        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        /* Read the resulted cipher text */
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &cipherText[index], numBytes);

        numPagesLeft = numPagesLeft - numPages;
        index = index + numBytes;
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_DecryptECB
 * Description   : This function performs the AES-128 decryption in ECB mode of
 * the input cipher text buffer.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_DecryptECB(csec_key_id_t keyId,
                                      const uint8_t *cipherText,
                                      uint32_t length,
                                      uint8_t *plainText)
{
    uint32_t numPagesLeft = length >> CSEC_BYTES_TO_FROM_PAGES_SHIFT;
    csec_error_code_t stat = CSEC_NO_ERROR;
    uint8_t index = 0;

    /* Loop and launch commands until the end of the cipher text */
    while (numPagesLeft > 0U)
    {
        uint16_t numPages = (uint16_t)((numPagesLeft > CSEC_DATA_PAGES_AVAILABLE) ?
                                        CSEC_DATA_PAGES_AVAILABLE : numPagesLeft);
        uint8_t numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);

        /* Write the cipher text */
        CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &cipherText[index], numBytes);
        /* Write the size of the cipher text (in pages) */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_PAGE_LENGTH_OFFSET, numPages);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_DEC_ECB, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, keyId);

