abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        /* Read the resulted plain text */
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &plainText[index], numBytes);

        numPagesLeft = numPagesLeft - numPages;
        index = index + numBytes;
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_EncryptCBC
 * Description   : This function performs the AES-128 encryption in CBC mode of
 * the input cipher text buffer.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_EncryptCBC(csec_key_id_t keyId,
                                      const uint8_t *plainText,
                                      uint32_t length,
                                      const uint8_t *iv,
                                      uint8_t *cipherText)
{
    csec_call_sequence_t seq = CSEC_CALL_SEQ_FIRST;
    uint16_t numPagesTotal = (uint16_t)(length >> CSEC_BYTES_TO_FROM_PAGES_SHIFT);
    uint16_t numPagesLeft = numPagesTotal;
    uint8_t index = 0;
    csec_error_code_t stat = CSEC_NO_ERROR;

    /* Loop and launch commands until the end of the cipher text */
    while (numPagesLeft > 0U)
    {
        uint16_t numPages;
        uint8_t numBytes;

        /* Write the plain text. The first call of encryption shall also include
        the IV. Further calls only include the plain text */
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            numPages = (uint16_t)((numPagesLeft > (CSEC_DATA_PAGES_AVAILABLE - 1U)) ?
                                  (CSEC_DATA_PAGES_AVAILABLE - 1U) : numPagesLeft);
            numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, iv, CSEC_PAGE_SIZE_IN_BYTES);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, &plainText[index], numBytes);
        }
        else
        {
            numPages = (uint16_t)((numPagesLeft > CSEC_DATA_PAGES_AVAILABLE) ?
                                   CSEC_DATA_PAGES_AVAILABLE : numPagesLeft);
            numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &plainText[index], numBytes);
        }
        /* Write the size of the plain text (in pages) */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_PAGE_LENGTH_OFFSET, numPagesTotal);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_ENC_CBC, CSEC_FUNC_FORMAT_COPY, seq, keyId);

        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        /* Read the resulted cipher text. For the first call, start from the
        second page, as the first page is occupied by the IV */
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, &cipherText[index], numBytes);
            seq = CSEC_CALL_SEQ_SUBSEQUENT;
        }
        else
        {
            CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &cipherText[index], numBytes);
        }

        numPagesLeft = numPagesLeft - numPages;
        index = index + numBytes;
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_DecryptCBC
 * Description   : This function performs the AES-128 decryption in CBC mode of
 * the input cipher text buffer.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_DecryptCBC(csec_key_id_t keyId,
                                      const uint8_t *cipherText,
                                      uint16_t length,
                                      const uint8_t* iv,
                                      uint8_t *plainText)
{
    csec_call_sequence_t seq = CSEC_CALL_SEQ_FIRST;
    uint16_t numPagesTotal = length >> CSEC_BYTES_TO_FROM_PAGES_SHIFT;
    uint16_t numPagesLeft = numPagesTotal;
    uint8_t index = 0;
    csec_error_code_t stat = CSEC_NO_ERROR;

    /* Loop and launch commands until the end of the cipher text */
    while (numPagesLeft > 0U)
    {
        uint16_t numPages;
        uint8_t numBytes;

        /* Write the cipher text. The first call of encryption shall also include
        the IV. Further calls only include the plain text */
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            numPages = (uint16_t)((numPagesLeft > (CSEC_DATA_PAGES_AVAILABLE - 1U)) ?
                                  (CSEC_DATA_PAGES_AVAILABLE - 1U) : numPagesLeft);
            numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, iv, CSEC_PAGE_SIZE_IN_BYTES);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, &cipherText[index], numBytes);
        }
        else
        {
            numPages = (uint16_t)((numPagesLeft > CSEC_DATA_PAGES_AVAILABLE) ?
                                   CSEC_DATA_PAGES_AVAILABLE : numPagesLeft);
            numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &cipherText[index], numBytes);
        }
        /* Write the size of the cipher text (in pages) */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_PAGE_LENGTH_OFFSET, numPagesTotal);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_DEC_CBC, CSEC_FUNC_FORMAT_COPY, seq, keyId);

