abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        /* Read the resulted plain text. For the first call, start from the
        second page, as the first page is occupied by the IV */
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, &plainText[index], numBytes);
            seq = CSEC_CALL_SEQ_SUBSEQUENT;
        }
        else
        {
            CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &plainText[index], numBytes);
        }

        numPagesLeft = numPagesLeft - numPages;
        index = index + numBytes;
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_GenerateMAC
 * Description   : This function calculates the MAC of a given message using
 * CMAC with AES-128.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_GenerateMAC(csec_key_id_t keyId,
                                       const uint8_t *msg,
                                       uint32_t msgLen,
                                       uint8_t *cmac)
{
    csec_call_sequence_t seq = CSEC_CALL_SEQ_FIRST;
    /* Size of the message is given in bits, compute the number of bytes */
    uint32_t numBytesLeft = CSEC_DRV_RoundTo(msgLen, 0x8) >> CSEC_BYTES_TO_FROM_BITS_SHIFT;
    csec_error_code_t stat = CSEC_NO_ERROR;
    uint8_t index = 0;

    /* Loop and launch commands until the end of the message */
    while (numBytesLeft > 0U)
    {
        uint8_t numBytes = (uint8_t)((numBytesLeft > CSEC_DATA_BYTES_AVAILABLE) ?
                                      CSEC_DATA_BYTES_AVAILABLE : numBytesLeft);

        /* Write the message for which the MAC will be computed  */
        CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &msg[index], numBytes);
        /* Write the size of the message (in bits) */
        CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_MESSAGE_LENGTH_OFFSET, &msgLen, 1U);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_GENERATE_MAC, CSEC_FUNC_FORMAT_COPY, seq, keyId);

        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        numBytesLeft = numBytesLeft - numBytes;
        index = index + numBytes;
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            seq = CSEC_CALL_SEQ_SUBSEQUENT;
        }
    }

    /* Read the resulted CMAC */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, cmac, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_GenerateMACAddrMode
 * Description   : This function calculates the MAC of a given message using
 * CMAC with AES-128. It is different from the CSEC_DRV_GenerateMAC function in
 * the sense that it does not involve an extra copy of the data on which the
 * CMAC is computed and the message pointer should be a pointer to Flash memory.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_GenerateMACAddrMode(csec_key_id_t keyId,
                                               const uint8_t *msg,
                                               uint32_t msgLen,
                                               uint8_t *cmac)
{
    csec_error_code_t stat;

    /* Write the address of the message */
    CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_FLASH_START_ADDRESS_OFFSET, (uint32_t *)&msg, 1U);
    /* Write the size of the message (in bits) */
    CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_MESSAGE_LENGTH_OFFSET, &msgLen, 1U);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCmdAndWait(CSEC_CMD_GENERATE_MAC, CSEC_FUNC_FORMAT_ADDR, CSEC_CALL_SEQ_FIRST, keyId);

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();
    /* Read the resulted MAC */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, cmac, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_VerifyMAC
 * Description   : This function verifies the MAC of a given message using CMAC
 * with AES-128.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_VerifyMAC(csec_key_id_t keyId,
                                     const uint8_t *msg,
                                     uint32_t msgLen,
                                     const uint8_t *mac,
                                     uint16_t macLen,
                                     bool *verifStatus)
{
    csec_call_sequence_t seq = CSEC_CALL_SEQ_FIRST;
    uint32_t numBytesLeft = CSEC_DRV_RoundTo(msgLen, 0x8) >> CSEC_BYTES_TO_FROM_BITS_SHIFT;
    csec_error_code_t stat = CSEC_NO_ERROR;
    uint8_t index = 0;
    bool macWritten = false;

    /* Loop and launch commands until the end of the message */
    while (!macWritten)
    {
        uint8_t numBytes = (uint8_t)((numBytesLeft > CSEC_DATA_BYTES_AVAILABLE) ?
                                     CSEC_DATA_BYTES_AVAILABLE : numBytesLeft);
        /* Compute the offset of the MAC inside the CSE_PRAM. The MAC parameter
        is located after the message, starting from a new page */
        uint8_t macOffset = (uint8_t)CSEC_DRV_RoundTo(numBytes, 0x10);

