abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
        /* Write the message for which the MAC will be verified */
        if (numBytes > 0U)
        {
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &msg[index], numBytes);
        }
        /* If there is available space in CSE_PRAM, write the MAC to be verified */
        if ((macOffset + CSEC_PAGE_SIZE_IN_BYTES) < CSEC_DATA_BYTES_AVAILABLE)
        {
            CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET + macOffset, mac, CSEC_PAGE_SIZE_IN_BYTES);
            macWritten = true;
        }
        /* Write the size of the message (in bits) */
        CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_MESSAGE_LENGTH_OFFSET, &msgLen, 1U);
        /* Write the number of bits of the MAC to be compared */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_MAC_LENGTH_OFFSET, macLen);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_VERIFY_MAC, CSEC_FUNC_FORMAT_COPY, seq, keyId);

        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        numBytesLeft = numBytesLeft - numBytes;
        index = index + numBytes;
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            seq = CSEC_CALL_SEQ_SUBSEQUENT;
        }
    }

    /* Read the result of the verification */
    if (stat == CSEC_NO_ERROR)
    {
        *verifStatus = (CSEC_HAL_ReadCommandHalfWord(FSL_FEATURE_CSEC_VERIFICATION_STATUS_OFFSET) == 0U);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_VerifyMACAddrMode
 * Description   : This function verifies the MAC of a given message using CMAC
 * with AES-128. It is different from the CSEC_DRV_VerifyMAC function in the
 * sense that it does not involve an extra copy of the data on which the CMAC is
 * computed and the message pointer should be a pointer to Flash memory.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_VerifyMACAddrMode(csec_key_id_t keyId,
                                             const uint8_t *msg,
                                             uint32_t msgLen,
                                             const uint8_t *mac,
                                             uint16_t macLen,
                                             bool *verifStatus)
{
    csec_error_code_t stat;

    /* Write the address of the message */
    CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_FLASH_START_ADDRESS_OFFSET, (uint32_t *)&msg, 1U);
    /* Write the MAC to be verified */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, mac, CSEC_PAGE_SIZE_IN_BYTES);
    /* Write the size of the message (in bits) */
    CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_MESSAGE_LENGTH_OFFSET, &msgLen, 1U);
    /* Write the number of bits of the MAC to be compared */
    CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_MAC_LENGTH_OFFSET, macLen);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCmdAndWait(CSEC_CMD_VERIFY_MAC, CSEC_FUNC_FORMAT_ADDR, CSEC_CALL_SEQ_FIRST, keyId);
    
    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();

    /* Read the result of the MAC verification */
    if (stat == CSEC_NO_ERROR)
    {
        *verifStatus = (CSEC_HAL_ReadCommandHalfWord(FSL_FEATURE_CSEC_VERIFICATION_STATUS_OFFSET) == 0U);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_LoadKey
 * Description   : This function updates an internal key per the SHE
 * specification.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_LoadKey(csec_key_id_t keyId,
                                   const uint8_t *m1,
                                   const uint8_t *m2,
                                   const uint8_t *m3,
                                   uint8_t *m4,
                                   uint8_t *m5)
{
    csec_error_code_t stat;

    /* Write the values of M1-M3 */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, m1, CSEC_M1_SIZE_IN_BYTES);
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, m2, CSEC_M2_SIZE_IN_BYTES);
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_4_OFFSET, m3, CSEC_M3_SIZE_IN_BYTES);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_LOAD_KEY, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, keyId);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();

    /* Read the obtained M4 and M5 */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_5_OFFSET, m4, CSEC_M4_SIZE_IN_BYTES);
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_7_OFFSET, m5, CSEC_M5_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_LoadPlainKey
 * Description   : Updates the RAM key memory slot with a 128-bit plaintext.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_LoadPlainKey(const uint8_t *plainKey)
{
    /* Write the bytes of the key */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, plainKey, CSEC_PAGE_SIZE_IN_BYTES);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_LOAD_PLAIN_KEY, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_RAM_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_ExportRAMKey
 * Description   : This function exports the RAM_KEY into a format protected by
 * SECRET_KEY.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_ExportRAMKey(uint8_t *m1,
                                        uint8_t *m2,
                                        uint8_t *m3,
                                        uint8_t *m4,
                                        uint8_t *m5)
{
    csec_error_code_t stat;

    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_EXPORT_RAM_KEY, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_RAM_KEY);

