abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();
    if (stat == CSEC_NO_ERROR)
    {
        /* Read the M1-M5 values associated with the key */
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, m1, CSEC_M1_SIZE_IN_BYTES);
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, m2, CSEC_M2_SIZE_IN_BYTES);
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_4_OFFSET, m3, CSEC_M3_SIZE_IN_BYTES);
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_5_OFFSET, m4, CSEC_M4_SIZE_IN_BYTES);
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_7_OFFSET, m5, CSEC_M5_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_InitRNG
 * Description   : The function initializes the seed and derives a key for the
 * PRNG. The function must be called before CMD_RND after every power cycle/reset.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_InitRNG()
{
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_INIT_RNG, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_ExtendSeed
 * Description   : Extends the seed of the PRNG by compressing the former seed
 * value and the supplied entropy into a new seed. This new seed is then to be
 * used to generate a random number by invoking the CMD_RND command. The random
 * number generator must be initialized by CMD_INIT_RNG before the seed may be
 * extended.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_ExtendSeed(const uint8_t *entropy)
{
    /* Write the entropy parameter */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, entropy, CSEC_PAGE_SIZE_IN_BYTES);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_EXTEND_SEED, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_GenerateRND
 * Description   : The function returns a vector of 128 random bits. The random
 * number generator has to be initialized by calling CSEC_DRV_InitRNG before
 * random numbers can be supplied.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_GenerateRND(uint8_t *rnd)
{
    csec_error_code_t stat;

    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_RND, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();
    /* Read the resulted random bytes */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, rnd, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_BootFailure
 * Description   : The function is called during later stages of the boot
 * process to detect a failure.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_BootFailure()
{
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_BOOT_FAILURE, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_BootOK
 * Description   : The function is called during later stages of the boot
 * process to mark successful boot verification.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_BootOK()
{
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_BOOT_OK, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_BootDefine
 * Description   : The function implements an extension of the SHE standard to
 * define both the user boot size and boot method.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_BootDefine(uint32_t bootSize,
                                      csec_boot_flavor_t bootFlavor)
{
    uint8_t flavor = (uint8_t) bootFlavor;

    /* Write the boot size and the boot flavor parameters */
    CSEC_HAL_WriteCommandWords(FSL_FEATURE_CSEC_BOOT_SIZE_OFFSET, &bootSize, 1U);
    CSEC_HAL_WriteCommandByte(FSL_FEATURE_CSEC_BOOT_FLAVOR_OFFSET, flavor);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_BOOT_DEFINE, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

