abraham120/trampoline/machines/cortex/armv7em/s32k144/drivers/fsl_csec_driver.c
    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_GetID
 * Description   : This function returns the identity (UID) and the value of the
 * status register protected by a MAC over a challenge and the data.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_GetID(const uint8_t *challenge,
                                 uint8_t *uid,
                                 uint8_t *sreg,
                                 uint8_t *mac)
{
    csec_error_code_t stat;

    /* Write the challenge */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, challenge, CSEC_PAGE_SIZE_IN_BYTES);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_GET_ID, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();
    if (stat == CSEC_NO_ERROR)
    {
        /* Read the UID */
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_2_OFFSET, uid, (uint8_t)(CSEC_PAGE_SIZE_IN_BYTES - 1U));
        /* Read the value of the SREG register */
        *sreg = CSEC_HAL_ReadCommandByte(FSL_FEATURE_CSEC_SREG_OFFSET);
        /* Read the MAC over the UID and the SREG */
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_3_OFFSET, mac, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_DbgChal
 * Description   : This function obtains a random number which the user shall
 * use along with the MASTER_ECU_KEY and UID to return an authorization request.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_DbgChal(uint8_t *challenge)
{
    csec_error_code_t stat;

    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_DBG_CHAL, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    stat = CSEC_HAL_ReadErrorBits();
    /* Read the challenge generated by the CSEc module */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, challenge, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_DbgAuth
 * Description   : This function erases all keys (actual and outdated) stored in
 * NVM Memory if the authorization is confirmed by CSEc.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_DbgAuth(const uint8_t *authorization)
{
    /* Write the authorization computed from the challenge */
    CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, authorization, CSEC_PAGE_SIZE_IN_BYTES);
    /* Write the command header. This will trigger the command execution. */
    CSEC_HAL_WriteCommandHeader(CSEC_CMD_DBG_AUTH, CSEC_FUNC_FORMAT_COPY, CSEC_CALL_SEQ_FIRST, CSEC_SECRET_KEY);

    /* Wait until the execution of the command is complete */
    CSEC_HAL_WaitCommandCompletion();

    /* Read the status of the execution */
    return CSEC_HAL_ReadErrorBits();
}

/*FUNCTION**********************************************************************
 *
 * Function Name : CSEC_DRV_MPCompress
 * Description   : This function accesses a Miyaguchi-Prenell compression
 * feature within the CSEc feature set to compress the given messages.
 *
 *END**************************************************************************/
csec_error_code_t CSEC_DRV_MPCompress(const uint8_t *msg,
                                      uint16_t msgLen,
                                      uint8_t *mpCompress)
{
    csec_call_sequence_t seq = CSEC_CALL_SEQ_FIRST;
    csec_error_code_t stat = CSEC_NO_ERROR;
    uint8_t index = 0;
    uint16_t numPagesLeft = msgLen;

    /* Loop and launch commands until the end of the message */
    while (numPagesLeft > 0U)
    {
        uint8_t numPages = (uint8_t)((msgLen > CSEC_DATA_PAGES_AVAILABLE) ?
                                      CSEC_DATA_PAGES_AVAILABLE : msgLen);
        uint8_t numBytes = (uint8_t)(numPages << CSEC_BYTES_TO_FROM_PAGES_SHIFT);

        /* Write the message */
        CSEC_HAL_WriteCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, &msg[index], numBytes);
        /* Write the size of the message */
        CSEC_HAL_WriteCommandHalfWord(FSL_FEATURE_CSEC_PAGE_LENGTH_OFFSET, msgLen);
        /* Write the command header. This will trigger the command execution. */
        CSEC_HAL_WriteCommandHeader(CSEC_CMD_MP_COMPRESS, CSEC_FUNC_FORMAT_COPY, seq, CSEC_SECRET_KEY);

        /* Wait until the execution of the command is complete */
        CSEC_HAL_WaitCommandCompletion();

        /* Read the status of the execution */
        stat = CSEC_HAL_ReadErrorBits();
        if (stat != CSEC_NO_ERROR)
        {
            break;
        }

        numPagesLeft = numPagesLeft - numPages;
        index = index + numBytes;
        if (seq == CSEC_CALL_SEQ_FIRST)
        {
            seq = CSEC_CALL_SEQ_SUBSEQUENT;
        }
    }

    /* Read the result of the compression */
    if (stat == CSEC_NO_ERROR)
    {
        CSEC_HAL_ReadCommandBytes(FSL_FEATURE_CSEC_PAGE_1_OFFSET, mpCompress, CSEC_PAGE_SIZE_IN_BYTES);
    }

    return stat;
}
/******************************************************************************
 * EOF
 *****************************************************************************/
